app/views/rentals/show.html.erb

SELECT "images".* FROM "images" WHERE "images"."rental_id" = ?  [["rental_id", 1]]
---
		<div id="owl-carousel" class="owl-carousel">
  		<% @rental.images.each do |image| %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."rental_id" = ?  [["rental_id", 1]]
---
  </tr>
<% @rental.reviews.each do |review| %>