app/controllers/rentals_controller.rb

  def index
    @rental = Rental.new
    @filterrific = initialize_filterrific(
    	Rental,
   		params[:filterrific]
  	) or return
		@rentals = Rental.all
---
SELECT "rentals".* FROM "rentals"

    def set_rental
      @rental = Rental.find(params[:id])
---
SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT 1  [["id", 1]]