app/controllers/reviews_controller.rb

  def update
    respond_to do |format|
      if @review.update(review_params)
---
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "Dirty but nice enough"], ["updated_at", "2016-09-30 08:38:09.616246"], ["id", 4]]